# Используем официальный образ Node.js в качестве базового образа
FROM node:latest

# Устанавливаем директорию приложения в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости проекта из package-lock.json без его обновления
RUN npm ci

# Копируем все файлы из текущей директории в директорию приложения в контейнере
COPY . .

# Установка порта для приложения
ENV PORT=3000

# Определение порта, который будет слушать контейнер при запуске
EXPOSE $PORT

# Указываем команду запуска приложения
CMD ["npm", "start"]
